---
kind: type
id: T:Autodesk.Revit.DB.AlternateUnits
source: html/186523a5-4f44-d7a7-a269-9c56644ca71a.htm
---
# Autodesk.Revit.DB.AlternateUnits

An enumerated type listing the locations where Alternate units may be displayed in dimensions.

## Syntax (C#)
```csharp
public enum AlternateUnits
```